# GraphicDisplayOptionsSsIntensity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GraphicDisplayOptionsSsIntensity Property
ParameterTypeId Class See Also
---
"Sun and Shadow Intensity"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GraphicDisplayOptionsSsIntensity { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GraphicDisplayOptionsSsIntensity As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GraphicDisplayOptionsSsIntensity {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace